Revit 2027 API
DuctSettings.GetSpecificFittingAngles Method
 Gets the list of specific fitting angles.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetSpecificFittingAngles()
Public Function GetSpecificFittingAngles As IList(Of Double)
public:
IList<double>^ GetSpecificFittingAngles()
member GetSpecificFittingAngles : unit -> IList<float>
Return Value
IList<Double>
 Angles (in degrees).
Remarks
 Revit will only use the angles specified during the pipe layout or modifying the pipe layout. When laying out the pipes, if the angle between two pipes is close to the allowed angle, the specific angle is used for that pipe fitting.
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace